[
    {
        "link": "https://en.wikipedia.org/wiki/Cristiano_Ronaldo",
        "content": "Portuguese professional footballer"
    },
    {
        "link": "https://en.wikipedia.org/wiki/Ronaldo_(Brazilian_footballer)",
        "content": "Ronaldo Luís Nazário de Lima (Brazilian Portuguese: ; born 18 September 1976), commonly known as Ronaldo, is a Brazilian business owner, president of Segunda División club Real Valladolid, owner of Brasileiro Série B club Cruzeiro, and a retired professional footballer who played as a striker. Popularly dubbed O Fenômeno (\"The Phenomenon\"), and also nicknamed R9, he is widely considered one of the greatest players of all time. As a multi-functional striker who brought a new dimension to the position, Ronaldo has been the influence for a generation of strikers that have followed. His individual accolades include being named FIFA World Player of the Year three times, and winning two Ballon d'Or awards."
    },
    {
        "link": "https://en.wikipedia.org/wiki/Ronald",
        "content": "Ronald is a masculine given name derived from the Old Norse Rögnvaldr, or possibly from Old English Regenweald. In some cases Ronald is an Anglicised form of the Gaelic Raghnall, a name likewise derived from Rögnvaldr. The latter name is composed of the Old Norse elements regin (\"advice\", \"decision\") and valdr (\"ruler\"). Ronald was originally used in England and Scotland, where Scandinavian influences were once substantial, although now the name is common throughout the English-speaking world. A short form of Ronald is Ron. Pet forms of Ronald include Roni and Ronnie. Ronalda and Rhonda are feminine forms of Ronald. Rhona, a modern name apparently only dating back to the late nineteenth century, may have originated as a feminine form of Ronald. The names Renaud/Renault and Reynold/Reinhold are cognates from French and German respectively. The name Ronaldo is a cognate from Spanish and Portuguese."
    },
    {
        "link": "https://en.wikipedia.org/wiki/Messi%E2%80%93Ronaldo_rivalry",
        "content": "Portuguese professional footballer"
    },
    {
        "link": "https://en.wikipedia.org/wiki/Ronaldo_Souza",
        "content": "Ronaldo Souza dos Santos (born December 7, 1979), nicknamed Jacaré (Portuguese pronunciation: ), is a retired Brazilian mixed martial artist and submission grappler, who competed for UFC. A highly regarded grappler on the world stage, Souza is also the former Strikeforce Middleweight Champion, and has also formerly competed for DREAM, and Jungle Fight."
    },
    {
        "link": "https://en.wikipedia.org/wiki/List_of_career_achievements_by_Cristiano_Ronaldo",
        "content": "Portuguese professional footballer"
    },
    {
        "link": "https://en.wikipedia.org/wiki/Ronaldinho",
        "content": "Ronaldo de Assis Moreira (born 21 March 1980), commonly known as Ronaldinho Gaúcho (Brazilian Portuguese: ) or simply Ronaldinho, is a Brazilian retired professional footballer who played mostly as an attacking midfielder, but was also deployed as a winger. Considered one of the best players of his generation and regarded by many as one of the greatest of all time, Ronaldinho won two FIFA World Player of the Year awards and a Ballon d'Or. A global icon of the sport, he was renowned for his technical skills, creativity, dribbling ability and accuracy from free-kicks, his use of tricks, feints, no-look passes and overhead kicks, as well as his ability to score and create goals."
    },
    {
        "link": "https://en.wikipedia.org/wiki/Ronaldo_Kwateh",
        "content": "Ronaldo Joybera Junior Kwateh (born October 19, 2004) is an Indonesian professional footballer who plays as a or winger or forward for Liga 1 club Madura United and the Indonesia national team."
    },
    {
        "link": "https://en.wikipedia.org/wiki/Cristiano_Ronaldo_International_Airport",
        "content": "Cristiano Ronaldo International Airport, Madeira, commonly known as Madeira Airport (Portuguese: Aeroporto da Madeira), Funchal Airport (Aeroporto do Funchal), or Santa Catarina Airport (Aeroporto de Santa Catarina) (IATA: FNC, ICAO: LPMA), is an international airport in the civil parish of Santa Cruz in the Portuguese archipelago and autonomous region of Madeira. The airport is located 13.2 km (8.2 mi) east-northeast of the regional capital, Funchal, after which it is sometimes informally named. It mostly hosts flights to European metropolitan destinations due to Madeira's importance as a leisure destination, and is pivotal in the movement of cargo in and out of the archipelago of Madeira. It is the fourth-busiest airport in Portugal. The airport is named after Madeiran native Cristiano Ronaldo, who is widely considered to be one of the greatest footballers of all time. During its renaming ceremony in 2017, the airport gained fame for an infamous bust of Ronaldo unveiled at the ceremony."
    },
    {
        "link": "https://en.wikipedia.org/wiki/Ronaldo_Camar%C3%A1",
        "content": "Ronaldo Camará (born 5 January 2003) is a Portuguese professional footballer who plays as a midfielder for the under-19 squad of Italian club Monza."
    }
]